IDEA Open Model
CheckResBolt Class
Compatible with IDEA StatiCa Beta 20.0
 Check value for Bolts
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Connection.CheckResBolt
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
[SerializableAttribute]
public class CheckResBolt
<SerializableAttribute>
Public Class CheckResBolt
The CheckResBolt type exposes the following members.
Constructors
Name | Description
CheckResBolt
Initializes a new instance of the CheckResBolt class
Top
Properties
Name | Description
CheckStatus
 Status of the Check
LoadCaseId
 Id of Load Case
Name
 Name
UnityCheck
 Unity Check
Top
See Also
Reference
IdeaRS.OpenModel.Connection Namespace